If we want to create hundreds or even thousands of records, there is definitely no way we could write that many insert statements into our SQL. It will be very terious and time consuming.

To make it easy, we will use Python. To start, install python packages using pip. Open anaconda prompt and type (without quotes) "pip install pandas Faker sqlalchemy mysqlclient".

Import libraries--
Faker — We will use this to generate our dummy data.
Pandas — This is a data analysis tool that will be used to package our dummy data and convert it to tables in a database system.
SQLAlchemy — This is an Object Relational Mapper(ORM) for SQL. ORM will be used as our database engine as it will provide connection to our database.

In [1]:
import pandas as pd
from faker import Faker
from collections import defaultdict # will act as our dictionary as it will provide additional functionality over a normal dictionary
from sqlalchemy import create_engine

In [18]:
fake = Faker()

In [19]:
fake_data = defaultdict(list) #  will create a dictionary that will create key-value pairs that are not currently stored within the dictionary when accessed. Essentially, you do not need to define any keys within your dictionary.

In [20]:
# example:
for _ in range(1000):
    fake_data["first_name"].append( fake.first_name() )
    fake_data["last_name"].append( fake.last_name() )
    fake_data["occupation"].append( fake.job() )
    fake_data["dob"].append( fake.date_of_birth() )
    fake_data["country"].append( fake.country() )

We can access this data through different methods within the fake data instance. The methods we’ll be accessing are first_name() , last_name(), job(), date_of_birth() and country().

In [21]:
df_fake_data = pd.DataFrame(fake_data)

In [22]:
df_fake_data

,first_name,last_name,occupation,dob,country
0,Christopher,Frazier,Ranger/warden,2012-11-17,Papua New Guinea
1,Elizabeth,Sawyer,"Administrator, local government",1991-09-26,Latvia
2,Kimberly,Pace,"Therapist, music",2014-12-31,Western Sahara
3,Jessica,Patterson,Chief Technology Officer,1952-06-13,Bahamas
4,John,King,Ship broker,1995-07-14,Lebanon
...,...,...,...,...,...
995,Steven,Scott,Newspaper journalist,2006-11-14,Argentina
996,Emily,Cunningham,Advertising account executive,2010-09-17,Bangladesh
997,Whitney,Davidson,"Scientist, biomedical",1954-12-17,Hong Kong
998,Melissa,Wu,Contracting civil engineer,1946-12-19,Trinidad and Tobago
999,Laura,Donovan,Film/video editor,1980-05-26,Christmas Island

Install mysqlconnector using "pip install mysql-connector" in anoconda prompt.

In [23]:
import sqlalchemy
database_username = 'username'
database_password = 'password'
database_ip       = 'ip address'
database_name     = 'database'
database_connection = sqlalchemy.create_engine('mysql+mysqlconnector://{0}:{1}@{2}/{3}'.
                                               format(database_username, database_password, 
                                                      database_ip, database_name))
df_fake_data.to_sql(con=database_connection, name='table_name_for_df', if_exists='replace')

We can get all this info (username....) from mysql workbench--> database-->manage connections.

Database_name is the database that you created in your Mysqlwb where you want this dummy data. After completing thus process, you can check the new table in our database in MySQLwb.